#### SegmentLengthRounding Property

---

|  |
| --- |
| FabricRoundingManager Class   See Also |

The rounding for fabric segments.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public double SegmentLengthRounding { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SegmentLengthRounding As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double SegmentLengthRounding { 	double get (); 	void set (double value); } ``` |

# Remarks

IsActiveOnElement property has to be true. SegmentLengthRounding is meaningless if IsActiveOnElement is false.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The given value for value is not a number |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The rounding value is not a positive value. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: IsActiveOnElement property is false. |

# See Also

FabricRoundingManager Class

Autodesk.Revit.DB.Structure Namespace